{
  "test_doc_1": {
    "type": "document",
    "source": "test"
  },
  "cb2217fc-9e5f-491f-a4d8-787a76869b48": {
    "rfp_type": "Safety_Specification",
    "equipment_type": "HT_LT_Cable",
    "service_category": "Safety_Contract",
    "content_summary": "The Annexure to tender document from CESC_Kolkata focuses on Safety Specifications for a service that is not explicitly mentioned. The main purpose of the RFP is to outline the safety requirements and regulations that the service provider must adhere to during the execution of the work. Key requirements include the appointment of a dedicated Safety Supervisor, provision of suitable safety measures at the work site, prevention of falls from height, insurance coverage for all personnel and equipment, reporting of accidents, and employee training on safety procedures.\n\nTechnical details involve the need for a parapet wall or railing to prevent falls, hazard communication to employees, obtaining permissions for work and equipment, ensuring medical fitness of all workers, and compliance with site-specific SOP for working under Covid19 conditions. The document also specifies the procedure for applying for Gate Pass, including submission of employee photographs, identification documents, medical test certificates, ESI & PF related documents, and the application process through the Security Officer via the Departmental Manager.\n\nThe timeline and deliverables are not explicitly mentioned in the document. Special conditions include the requirement for a Safety Supervisor, insurance coverage, accident reporting, and employee training. Commercial terms are not detailed in this document. Overall, the RFP emphasizes the importance of safety measures, compliance with regulations, and proper documentation for personnel working on the project.",
    "overall_confidence": 0.5319444444444444,
    "service_confidence": 0.5,
    "rfp_type_confidence": 0.37777777777777777,
    "document_version": "v1.0",
    "document_purpose": "supplement",
    "document_type": "Annexure to tender",
    "client_name": "CESC_Kolkata",
    "filename": "Annexure to tender_CESC Kolkata_Gate Pass and Safety Requirements.docx",
    "file_path": "Data\\Annexure to tender_CESC Kolkata_Gate Pass and Safety Requirements.docx",
    "key_terms": "transformer, transmission, cable, inspection, safety, quality, specification, requirement, financial, equipment, Procedure, Tool Box Talk, Min, Compulsory, Material Handling Hand Gloves, Safety Requirements\nSafety Terms, Hazard, Grade, Near Miss, Transformers Yard",
    "equipment_confidence": 0.25,
    "original_filename": "Annexure to tender_CESC Kolkata_Gate Pass and Safety Requirements.docx",
    "word_count": 2138,
    "client_confidence": 1.0,
    "processing_date": "2026-01-27 16:08:50.416797",
    "key_points": ". A dedicated Safety Supervisor must be present on-site to ensure compliance with safety requirements and safe working practices., . Safety measures are included in the rates, and suitable precautions such as parapet walls or railings must be provided to prevent falls., . Information and warnings about the dangers of falling from heights must be provided to all workers., . Insurance policies covering risks for all workers, supervisors, tools, equipment, and materials must be obtained at no extra cost., . Reporting of all incidents, near misses, and accidents to CESC and local authorities is mandatory, with a detailed investigation and remedial measures to be submitted within 7 days., . Hazard information must be communicated to employees through various means such as toolbox meetings, training sessions, and written notices in a language understood by the workers., . Prior permission is required for workers to commence work and bring tools and equipment on-site.",
    "is_duplicate": false,
    "complexity": "Complex"
  },
  "1509f8f3-161f-4603-b438-ed994f15f7ff": {
    "is_duplicate": false,
    "rfp_type": "Safety_Specification",
    "content_summary": "The Annexure to tender document issued by CESC_Kolkata focuses on Safety Specifications for contractors working on their projects. The main purpose of the RFP is to ensure that all work carried out under the contract complies with statutory safety requirements to protect the health and safety of personnel, plant, and assets. CESC emphasizes the importance of maintaining an incident-free organization by adhering to safety standards, guidelines, and practices. The document outlines the company's safety policy, which includes commitments to enhancing management systems, complying with legal requirements, involving employees in maintaining a safe workplace, and integrating safety standards into operational activities.\n\nKey requirements and specifications outlined in the document include definitions of terms such as Company, Company Property, Contractor, Environment, Work Force, Work, and High Risk Work. These definitions provide clarity on the roles and responsibilities of different parties involved in the project, as well as the scope of work covered under the safety specifications. The document also emphasizes the importance of incorporating safety criteria into business decisions, ensuring the availability of adequate resources for implementing safety standards, and communicating the safety policy to all personnel and stakeholders.\n\nTechnical details and equipment involved are not explicitly mentioned in the summary provided. The document primarily focuses on safety policies, definitions, and general safety requirements rather than specific technical details or equipment specifications. The timeline and deliverables, as well as commercial terms, are also not mentioned in the summary. However, the document does outline special conditions related to safety requirements, which are crucial for contractors to adhere to while working on CESC projects. Overall, the document serves as a comprehensive guide for contractors to understand and comply with safety specifications set forth by CESC_Kolkata when carrying out work under the contract.",
    "document_purpose": "supplement",
    "client_name": "CESC_Kolkata",
    "overall_confidence": 0.5069444444444444,
    "equipment_type": "HT_LT_Cable",
    "filename": "Annexure to tender_CESC Kolkata_Safety Terms.docx",
    "processing_date": "2026-01-27 16:08:56.761873",
    "service_category": "Safety_Contract",
    "document_type": "Annexure to tender",
    "file_path": "Data\\Annexure to tender_CESC Kolkata_Safety Terms.docx",
    "rfp_type_confidence": 0.33333333333333337,
    "equipment_confidence": 0.25,
    "key_terms": "transformer, transmission, cable, installation, testing, maintenance, inspection, safety, quality, specification, requirement, technical, financial, equipment, Fall Protection, Audiometry, Safety \nHelmet, It, Heavy Earth Moving Equipment Operators, Local",
    "client_confidence": 1.0,
    "word_count": 10022,
    "original_filename": "Annexure to tender_CESC Kolkata_Safety Terms.docx",
    "complexity": "Complex",
    "document_version": "v1.0",
    "service_confidence": 0.4444444444444444,
    "key_points": ". Compliance with all statutory safety requirements is mandatory for the Contractor throughout the execution of the work., . CESC emphasizes the importance of Occupational Health and Safety for personnel, plant, and assets., . The Contractor must adhere to safety standards, guidelines, and practices to achieve an incident-free organization., . Safety policies include enhancing management systems, ensuring legal compliance, integrating safety standards into operational activities, and involving all employees in maintaining a safe workplace., . Developing a safety culture through active leadership and providing competence building at all levels is essential., . Safety criteria must be considered in business decisions related to plant, technology, and performance appraisal., . Adequate resources must be available on time to implement safety standards effectively."
  },
  "1241fcfc-c026-4201-8782-eaef35879b7e": {
    "processing_date": "2026-01-27 16:09:04.990568",
    "filename": "EPC_CESC Kolkata for Distribution Station.docx",
    "equipment_confidence": 0.25,
    "specific_service": "distribution station",
    "word_count": 3314,
    "equipment_type": "PTR",
    "file_path": "Data\\EPC_CESC Kolkata for Distribution Station.docx",
    "complexity": "Complex",
    "key_terms": "transformer, substation, distribution, cable, installation, commissioning, testing, inspection, safety, specification, requirement, technical, commercial, delivery, warranty, infrastructure, equipment, Lot, Final, Cranes",
    "document_type": "EPC",
    "service_confidence": 0.4,
    "document_version": "v1.0",
    "is_duplicate": false,
    "client_confidence": 1.0,
    "document_purpose": "template",
    "content_summary": "The RFP document is for the establishment of two 33/11-6 kV Distribution Stations (D/S) at specific locations in Kolkata by CESC Limited. The main purpose of the RFP is to invite bids for the integrated work on an EPC basis for the construction of these distribution substations. The scope of work includes detailed project plans, excluding the supply of Power Transformer, RMU, and AIS Panel. Bidders are required to submit both an Unpriced Technical Bid and a Price Bid with commercial terms and conditions by the specified deadline of 10th May, 2025.\n\nKey requirements and specifications outlined in the RFP include the detailed scope of work for each Distribution Station, completion timeline by February 2026, and specific technical details such as Gantt Charts, material deliveries, and service activities. Bidders are also required to provide a signed copy of the Scope of Work and Specifications along with their Technical Bids. The document emphasizes the importance of completeness and clarity in bid submissions, with any incomplete or irregular bids being subject to rejection.\n\nThe RFP includes specific submission instructions, requiring Technical Bids to be submitted via email to designated recipients within separate files named after each Distribution Station. The document also outlines the commercial terms and conditions that should be included in the Price Bid. Bidders are advised to carefully review and adhere to all instructions and requirements to ensure their bids are considered for the project. Overall, the RFP provides a clear overview of the project scope, requirements, submission process, and timelines for interested bidders looking to participate in the establishment of the Distribution Stations for CESC Limited in Kolkata.",
    "original_filename": "EPC_CESC Kolkata for Distribution Station.docx",
    "key_points": ". CESC Limited is seeking bids for the establishment of Two (2) 33/11-6 kV Distribution Stations (D/S) in Kolkata on an EPC basis., . The project is divided into two parts: Part A for Mukundapur D/S and Part B for Barisha East D/S., . Bidders are required to submit an Unpriced Technical Bid and a Price Bid with commercial terms & conditions., . The scope of work for each package excludes the supply of Power Transformer, RMU, and AIS Panel., . The deadline for submission of Bid Documents is 10th May, 2025, up to 6.00 p.m., and late bids will not be accepted., . No alterations or additions to the Bid will be permitted after submission, and any corrections must be made with the bidder's dated signature., . Detailed Scope of Work and technical details are provided in the attached document.",
    "rfp_type": "EPC_Project",
    "rfp_type_confidence": 0.33333333333333337,
    "overall_confidence": 0.49583333333333335,
    "service_category": "Electrical_Infrastructure",
    "client_name": "CESC_Kolkata"
  },
  "2efdfdea-4453-4b25-b3ff-b0f903c64460": {
    "key_terms": "distribution, transmission, cable, installation, commissioning, testing, inspection, safety, quality, specification, requirement, technical, commercial, financial, timeline, delivery, warranty, infrastructure, equipment, Overhead Circuits",
    "original_filename": "EPC_CESC Kolkata for enhancement of tower.docx",
    "rfp_type": "EPC_Project",
    "is_duplicate": false,
    "processing_date": "2026-01-27 16:09:13.459521",
    "complexity": "Complex",
    "overall_confidence": 0.6666666666666667,
    "client_confidence": 1.0,
    "equipment_confidence": 1.0,
    "rfp_type_confidence": 0.33333333333333337,
    "document_type": "EPC",
    "word_count": 9687,
    "key_points": ". Tender is for the enhancement of height of 33 KV overhead circuits at Sankrail Station to facilitate the construction work of R.O.B of S E Railway., . CESC Limited is seeking bids for the supply, erection, and commissioning of four new towers each of 30 mtr height and stringing of conductors for four 33 KV overhead circuits in two sets., . Bids are required in two parts: Unpriced Techno-Commercial Bid and Price Bid (Annexure-II)., . Existing towers will remain unaltered at their current locations., . Deviations from tender terms are generally not admissible, and bids with deviations may be rejected., . Bids must be submitted before the deadline date and time, and no alterations or additions to the bid form will be permitted., . Any deviations from the tender terms must be clearly outlined by bidders and submitted as part of the Technical Bid using the deviation sheet provided in Annexure-VI.",
    "equipment_type": "Tower",
    "document_purpose": "template",
    "content_summary": "The RFP document is issued by CESC Limited for the enhancement of the height of 33 KV overhead circuits at Sankrail Station to facilitate the construction work of a Road Over Bridge (ROB) of South Eastern Railway. The scope of work includes the supply, erection, and commissioning of four new towers, each 30 meters in height, and stringing of conductors for four 33 KV overhead circuits. The existing towers will remain unaltered at their current locations. Bidders are required to submit both an Unpriced Techno-Commercial Bid and a Price Bid as per the provided guidelines. Deviations from the tender terms are generally not acceptable, and any deviations must be clearly outlined and submitted as part of the Technical Bid.\n\nThe document outlines specific requirements for the submission of bids, including the deadline for submission and the necessary documents that must be included with the bid. Bidders are advised against making deviations from the tender terms, as such bids may be rejected. The Technical Bid submission process is detailed, specifying the email addresses to which the bid must be sent. Additionally, mandatory documents such as the 'Schedule of Deviations' and 'Schedule of Commercial Specifications' must be duly signed and stamped by the bidder.\n\nThe RFP includes a pre-qualification criteria section that outlines the mandatory documents required along with the bid submission. These documents include the 'Schedule of Deviations,' 'Schedule of Commercial Specifications,' and a proper authorization letter or Power of Attorney to sign the tender on behalf of the bidder. The document emphasizes the importance of adhering to the submission guidelines and warns that incomplete, obscure, or irregular bids may be rejected. Bidders are instructed to initial all pages of the bid papers and accompanying documents and make corrections, if necessary, with dated signatures.",
    "document_version": "v1.0",
    "specific_service": "enhancement of tower",
    "service_category": "Electrical_Infrastructure",
    "filename": "EPC_CESC Kolkata for enhancement of tower.docx",
    "file_path": "Data\\EPC_CESC Kolkata for enhancement of tower.docx",
    "service_confidence": 0.3333333333333333,
    "client_name": "CESC_Kolkata"
  },
  "ca561f08-6bfa-408f-9ae2-e0170a4d529c": {
    "specific_service": "streetlight metering job",
    "is_duplicate": false,
    "original_filename": "EPC_CESC Kolkata for Streetlight Metering Job.docx",
    "overall_confidence": 0.6347222222222222,
    "service_confidence": 0.3888888888888889,
    "filename": "EPC_CESC Kolkata for Streetlight Metering Job.docx",
    "processing_date": "2026-01-27 16:09:21.566448",
    "rfp_type_confidence": 0.4,
    "key_points": ". Tender No. PUR:51998 dated 30.04.2025 for the replacement of existing streetlight metering units by whole current smart metering units at CESC Limited, Kolkata., . Last date for submission of Technical Bid (along with Pre-Qualification Documents) is 16.05.2025. Last date for submission of Price Bid is 26.05.2025., . Scope of work includes the installation of Smart Street Light Management System (SSLMS) units with specific quantities of 1-phase and 3-phase smart whole current meters along with in-built O/L and Dawn Dusk Controller throughout CESC Licensee area., . The contract duration is three years with a target of replacing 4000 SSLMS units per year., . Scope of supply of materials includes wiring materials of 1-ph and 3-ph metering units, as well as materials for field installation mentioned in clause 5 under section G (Procedure of Job Execution)., . CESC reserves the right to split the order quantity wise/Line item wise among two bidders., . The overall period of the contract is three years.",
    "equipment_type": "Energy_Meters",
    "complexity": "Complex",
    "key_terms": "transformer, distribution, cable, installation, commissioning, testing, maintenance, inspection, safety, quality, specification, requirement, technical, commercial, delivery, warranty, metering, billing, infrastructure, equipment",
    "client_name": "CESC_Kolkata",
    "document_type": "EPC",
    "word_count": 14515,
    "document_version": "v1.0",
    "service_category": "Electrical_Infrastructure",
    "document_purpose": "template",
    "rfp_type": "EPC_Project",
    "file_path": "Data\\EPC_CESC Kolkata for Streetlight Metering Job.docx",
    "content_summary": "The RFP document issued by CESC Limited, Kolkata, focuses on the replacement of existing streetlight metering units with whole current smart metering units. The main purpose of the RFP is to invite interested bidders to submit Technical and Commercial Bids for the integrated work project. The scope of work includes the installation of Smart Street Light Management System (SSLMS) units with specific quantities of 1-phase and 3-phase smart whole current meters equipped with O/L and Dawn Dusk Controller throughout the CESC Licensee area. The contract duration is three years, with a target of replacing 4000 SSLMS units per year.\n\nKey requirements and specifications outlined in the RFP include the supply of materials such as wiring materials for metering units, field installation materials, and the provision for the bidder to set up and maintain a local warehouse in Kolkata for storing materials and wired SSLMS units. The storage facility requirements emphasize the need for a clean, dry, well-ventilated, and properly illuminated warehouse to ensure the protection and functionality of the meters until installation. Specific conditions regarding the storage temperature (not exceeding 45 deg C) and protection against humidity, dust, and corrosive elements are also detailed.\n\nThe timeline for submission of bids is specified, with the last date for the submission of Technical Bid and Pre-Qualification Documents set for 16.05.2025, and the last date for the submission of Price Bid set for 26.05.2025. The document also mentions the possibility of CESC splitting the order quantity among two bidders and the potential extension of the contract beyond the initial one-year period based on bidder performance. Commercial terms are not explicitly mentioned in the provided excerpt, but the document may include details on payment terms, penalties, and other financial aspects. Overall, the RFP provides a detailed overview of the project scope, technical requirements, storage conditions, and timeline for interested bidders to consider when preparing their proposals.",
    "client_confidence": 1.0,
    "equipment_confidence": 0.75
  },
  "2187c641-92a9-4898-ba9a-576725ecfeb5": {
    "equipment_confidence": 1.0,
    "overall_confidence": 0.6805555555555556,
    "content_summary": "The RFP document is for a Rate Contract for DTR (Dry and Oil) Refurbishment at CESC, Kolkata, issued by CESC Limited, a power utility in the private sector under the RP-Sanjiv Goenka Group. The main purpose of the RFP is to invite bids from interested bidders to establish a Rate Contract for the repair and refurbishment of Distribution Transformers with a two-year validity period. Bidders are required to meet specific technical qualification criteria, including having their own transformer repairing workshop, repairing a minimum number of transformers of specified ratings in the last 3 years, and having facilities to carry out necessary tests as per CESC technical specifications.\n\nThe document outlines the availability of tender documents through newspaper advertisements and CESCs' tender website. Bidders are required to submit an email expressing their intent to bid and provide necessary details to receive the online bidding link. The pre-qualification criteria include technical qualifications such as owning a transformer repairing workshop, experience in repairing transformers of specific ratings, and obtaining performance certificates from reputed companies for similar work. Bidders not registered with CESC may undergo factory inspection and evaluation to assess their capability and quality procedures.\n\nThe timeline for bid submission is specified as the due date for bid submission is 04/11/25 at 18:00 Hrs. The document also mentions that in case the last date for bid submission and bid opening falls on a closed holiday for CESC's office, the deadlines will be extended to the next working day. The RFP emphasizes the importance of meeting technical qualifications, providing necessary documentation, and complying with CESC's technical specifications and standards to be considered for the Rate Contract for DTR refurbishment at CESC, Kolkata.",
    "document_purpose": "template",
    "key_terms": "transformer, substation, distribution, cable, commissioning, testing, inspection, safety, quality, specification, requirement, technical, commercial, financial, timeline, delivery, Financial Qualification Criteria, Total Amount, Bidding, Group Company",
    "client_name": "CESC_Kolkata",
    "service_confidence": 0.3888888888888889,
    "service_category": "Electrical_Infrastructure",
    "complexity": "Complex",
    "document_version": "v1.0",
    "rfp_type_confidence": 0.33333333333333337,
    "equipment_type": "DTR",
    "file_path": "Data\\Service and Supply_CESC Kolkata for DTR Refurbishment.docx",
    "processing_date": "2026-01-27 16:09:30.918283",
    "document_type": "Service and Supply",
    "filename": "Service and Supply_CESC Kolkata for DTR Refurbishment.docx",
    "word_count": 5915,
    "original_filename": "Service and Supply_CESC Kolkata for DTR Refurbishment.docx",
    "rfp_type": "Service_Agreement",
    "client_confidence": 1.0,
    "is_duplicate": false,
    "key_points": ". Tender Enquiry No.: PUR-52322 Dtd 13.10.2025, Due Date for Bid Submission: 04/11/25 [18:00 Hrs.], . Scope of work: Repair and Refurbishment of Distribution Transformer with two years validity., . Bids invited in Two Bid system for establishing a Rate Contract., . Availability of Tender Documents: Can be downloaded from CESCs’ tender website., . Pre-Qualification Criteria: Bidder should have own transformer repairing workshop., . Calendar of Events: Specifies the process in case of a closed holiday for CESC’s office., . CESC Limited is a power utility in the private sector engaged in electricity generation and distribution in Kolkata & Howrah.",
    "specific_service": "dtr refurbishment"
  },
  "5c178ce9-ae89-41e1-b333-0214e050d1d2": {
    "equipment_confidence": 1.0,
    "document_purpose": "template",
    "document_type": "Service",
    "file_path": "Data\\Service_CDPL Meter Reading & Bill Distribution.docx",
    "client_confidence": 0.8,
    "original_filename": "Service_CDPL Meter Reading & Bill Distribution.docx",
    "content_summary": "The RFP document issued by Chandigarh Power Distribution Limited (CPDL) is for a Rate Contract for 3 years for Meter Reading and Bill Distribution services for LT consumers without Tri-vector Meters. Bidders are required to comply with environmental and safety regulations in India and provide details of waste, noise, and oil leak management measures. The tender fee for accessing the detailed scope of work is Rs.1180/-, payable through online transfer mode only. Bids must be submitted by the due date and time specified in the event calendar, failing which the tender may be rejected. Non-compliance with tender fee payment, EMD deposit, technical details submission, or pricing requirements may lead to rejection of the bid.\n\nThe pre-qualification criteria specify that bidders must have experience in Meter Reading and Bill Distribution operations or similar work in at least 2 reputed Power distribution utilities in India, with a total value of Rs. 5 Crores in the last three years. This criterion aims to ensure that the selected bidder has the necessary expertise and experience to successfully execute the project. The RFP emphasizes the importance of technical qualifications and past performance in similar projects to qualify for consideration.\n\nThe document outlines the procedures for obtaining the schedule of specifications, submission of tender fee, and the consequences of non-compliance with the specified requirements. It also highlights the key events, such as bid submission deadlines and the criteria for acceptance or rejection of bids. The RFP aims to select a qualified vendor who can efficiently carry out the Meter Reading and Bill Distribution services for LT consumers of CPDL in Chandigarh. Interested bidders must carefully review and adhere to all the terms and conditions outlined in the RFP to submit a compliant and competitive bid for consideration.",
    "rfp_type_confidence": 0.3,
    "processing_date": "2026-01-27 16:09:39.463922",
    "service_category": "Electrical_Infrastructure",
    "key_terms": "distribution, transmission, cable, installation, commissioning, maintenance, safety, quality, specification, requirement, technical, commercial, financial, timeline, delivery, warranty, billing, infrastructure, equipment, Financial Proposals",
    "key_points": ". The RFP is for a 3-year Rate Contract for Meter Reading and Bill Distribution at CPDL, Chandigarh for LT consumers without Tri-vector Meters., . Bidders must comply with all relevant environmental and safety regulations in India, including outlining waste, noise, and oil leak management measures., . The tender fee for obtaining the schedule of specifications is Rs.1180/- (Inclusive of GST) and must be paid via online transfer mode (NEFT/RTGS) to CPDL's State Bank of India account., . Bidders who download tender papers from the CPDL website must submit a scan copy of the money receipt/UTR No as proof of online transfer when submitting the Bid document., . The Due Date for Bid Submission is 20.08.2025, up to 17:00 Hrs., . The technical specifications and detailed terms & conditions can be obtained from the CPDL tender website., . Bidders are required to provide services for reading energy meters and bill distribution as per the Scope of Work outlined in the bid document.",
    "rfp_type": "Metering_Project",
    "service_confidence": 0.4166666666666667,
    "filename": "Service_CDPL Meter Reading & Bill Distribution.docx",
    "client_name": "CDPL",
    "complexity": "Complex",
    "overall_confidence": 0.6291666666666667,
    "equipment_type": "Energy_Meters",
    "document_version": "v1.0",
    "word_count": 27843,
    "is_duplicate": false
  },
  "a5b6dc95-f5c5-4e43-ba72-23b3cb7d442f": {
    "word_count": 8337,
    "processing_date": "2026-01-27 16:09:48.212402",
    "original_filename": "Service_CESC Kolkata for Annual Overhauling of Boiler.docx",
    "complexity": "Complex",
    "overall_confidence": 0.6410714285714285,
    "document_version": "v1.0",
    "client_name": "CESC_Kolkata",
    "file_path": "Data\\Service_CESC Kolkata for Annual Overhauling of Boiler.docx",
    "filename": "Service_CESC Kolkata for Annual Overhauling of Boiler.docx",
    "specific_service": "annual overhauling of boiler",
    "key_terms": "distribution, cable, installation, commissioning, testing, maintenance, safety, quality, specification, requirement, technical, commercial, financial, timeline, equipment, Link, Days, State Insurance Act, West Bengal Gazette, Bids",
    "service_category": "Mechanical_Boiler",
    "document_type": "Service",
    "service_confidence": 0.5,
    "equipment_confidence": 0.75,
    "key_points": ". Tender is for the annual overhauling of Boiler & its auxiliaries at the Budge Budge Generating Station, a 250 MW Thermal Power Plant operated by CESC Limited., . The scope of work includes erection/in-situ repairing of high-pressure coils, renewal of windbox nozzle, cyclone, and overhauling of air preheater & flue gas ducts for Unit 2., . Bids are invited in two parts: Unpriced Techno-Commercial Bid and Price Bid., . Deviations from tender terms are generally not admissible, and bids with deviations may be rejected. Bidders must submit any deviations as part of the Technical Bid., . Bids must be submitted before the deadline date and time, and no alterations or additions to the bid form will be permitted., . The document emphasizes the importance of adhering to the tender terms and refraining from deviations to avoid rejection., . Detailed scope of work is provided in Annexure I, and a deviation sheet is required to be submitted as per Annexure-II.",
    "content_summary": "The RFP document is issued by CESC Limited for the annual overhauling of boilers and its auxiliaries at the Budge Budge Generating Station. The scope of work includes erection/in-situ repairing of high-pressure coils, renewal of windbox nozzle, cyclone, and associated jobs in boiler auxiliaries, as well as the overhaul of air preheater and flue gas ducts of Unit 2. The RFP is divided into two parts: Unpriced Techno-Commercial Bid and Price Bid. Deviations from the tender terms are generally not admissible, and bidders are advised to refrain from making any deviations. The document specifies that bids shall not be accepted after the deadline date and time, and any incomplete or irregular bids may be rejected at the discretion of CESC.\n\nThe document outlines the pre-qualification criteria for bidders, including the requirement to furnish an Earnest Money Deposit (EMD) of INR 2.20 Lakhs from any scheduled bank. The EMD will be forfeited if the bidder withdraws the price after submission, declines to accept the Work Order at quoted/agreed rates, or fails to start/execute the job after receiving the order. The EMD will be converted to an interest-free Security Deposit for the successful bidder to whom the Work Order is issued. The RFP emphasizes the importance of adhering to the submission guidelines, including initialing and signing all bid documents as required.\n\nThe RFP provides a detailed calendar of events and specifies that deviations to tender terms may lead to rejection of the bid. It also highlights the importance of submitting a complete and clear bid, with any corrections made by the bidder clearly indicated and signed. The document underscores the significance of meeting the specified deadlines and requirements to ensure consideration for the project. Additionally, the RFP includes technical details such as the equipment involved in the overhauling process and the specific tasks to be completed as part of the service agreement. Overall, the RFP serves as a comprehensive guide for potential bidders interested in providing services for the annual overhauling of boilers and auxiliaries at the Budge Budge Generating Station.",
    "equipment_type": "Boiler",
    "is_duplicate": false,
    "document_purpose": "template",
    "rfp_type_confidence": 0.3142857142857143,
    "client_confidence": 1.0,
    "rfp_type": "Service_Agreement"
  },
  "1d393901-77e9-4017-aca9-9f4e51b99873": {
    "equipment_type": "HT_LT_Cable",
    "original_filename": "Service_CESC Kolkata for General Civil Repair jobs.docx",
    "equipment_confidence": 0.25,
    "overall_confidence": 0.5458333333333334,
    "client_name": "CESC_Kolkata",
    "document_type": "Service",
    "filename": "Service_CESC Kolkata for General Civil Repair jobs.docx",
    "specific_service": "general civil repair jobs",
    "client_confidence": 1.0,
    "rfp_type_confidence": 0.4666666666666667,
    "processing_date": "2026-01-27 16:09:56.532232",
    "complexity": "Complex",
    "content_summary": "The Request for Proposal (RFP) issued by CESC Limited is for General Civil Repair Jobs at various establishments in and around Kolkata. The main purpose of the RFP is to invite bids from reputed and experienced bidders who can undertake civil repair jobs for CESC. The scope of work includes projects similar to those worth at least Rs. 0.5 crore or 2 projects of Rs. 0.25 crore each completed in the last 3 years. Bidders are required to meet specific pre-qualification criteria related to annual turnover, project completion history, company profile, and legal status.\n\nKey requirements and specifications outlined in the RFP include the submission of pre-qualification bids with supporting documents by a specified deadline. Bidders must adhere to the prescribed format for submission and provide essential details such as company turnover, project history, organizational hierarchy, and infrastructure details. Upon meeting the pre-qualifying requirements, qualified bidders will receive the complete set of Bid (Tender) documents for the submission of Techno-Commercial Bids.\n\nThe RFP also emphasizes that CESC reserves the right to assess the capabilities and qualifications of the bidders and their subcontractors to ensure satisfactory performance of the contract. Bidders may be required to demonstrate their experience in completing works of a similar nature as mentioned in the RFP. CESC also reserves the right to verify the information provided by the bidders. Overall, the RFP provides a clear outline of the requirements, submission process, and evaluation criteria for bidders interested in undertaking general civil repair jobs for CESC in Kolkata.",
    "document_purpose": "template",
    "key_terms": "substation, distribution, cable, commissioning, safety, quality, specification, requirement, technical, commercial, financial, timeline, delivery, warranty, survey, billing, infrastructure, equipment, Final, Hr\nBid",
    "is_duplicate": false,
    "file_path": "Data\\Service_CESC Kolkata for General Civil Repair jobs.docx",
    "service_confidence": 0.4666666666666666,
    "document_version": "v1.0",
    "rfp_type": "Service_Agreement",
    "word_count": 5015,
    "key_points": ". Tender is for General Civil Repair Jobs at Various Establishments of CESC in and around Kolkata., . Minimum annual turnover requirement of Rs. 100 Lacs in at least two out of the last three commercial years ending March 2025., . Completion of similar projects in the last 3 years, with specific project value requirements., . Submission of profile of completed and ongoing projects for the last 5 years, along with supporting documents., . Requirement for submission of copies of original documents defining legal status, date of establishment, and principal place of business., . Companies/consortiums must be registered under the Companies Act, 1956, and engaged in business for at least the last five years., . Verification of projects by CESC representatives may be facilitated if required.",
    "service_category": "Civil_Works"
  },
  "0c9b2551-c134-4fba-8b24-58fff6611f73": {
    "service_category": "Survey_Inspection",
    "document_type": "Service",
    "client_name": "CESC_Kolkata",
    "document_purpose": "template",
    "processing_date": "2026-01-27 16:10:03.962581",
    "overall_confidence": 0.5275,
    "original_filename": "Service_CESC Kolkata for GPR Survey.docx",
    "equipment_type": "HT_LT_Cable",
    "document_version": "v1.0",
    "is_duplicate": false,
    "content_summary": "The RFP document issued by CESC Limited is for conducting a Ground Penetrating Radar (GPR) survey along the Kona Expressway stretch between the 2nd Hooghly Bridge and Santragachi Flyover in Kolkata. The main purpose of the RFP is to identify underground utility assets in the specified area and prepare a topographical survey report. The scope of work includes conducting the GPR survey, submitting reports, and adhering to the technical specifications outlined in Annexure-II.\n\nKey requirements for potential bidders include submitting both an Unpriced Techno-Commercial Bid and a Price Bid as per Annexure-III. Deviations from the tender terms are generally not allowed, and any deviations must be clearly outlined in a separate deviation sheet (Annexure-V) as part of the Technical Bid. Bids must be submitted before the specified deadline, and any incomplete or irregular bids may be rejected at the discretion of CESC.\n\nTechnical details involve the submission of mandatory documents along with the bid, such as the Schedule of Deviations and Schedule of Commercial Specifications, both to be signed and stamped on the bidder's letterhead. Bidders must also provide a proper authorization letter or Power of Attorney to sign the tender on behalf of the bidder. The Technical Bid submission is to be done via email to the specified contact person at CESC.\n\nIn summary, the RFP seeks qualified bidders to conduct a GPR survey along a specific stretch of the Kona Expressway, with a focus on identifying underground utility assets and preparing a comprehensive report. Bidders must adhere to the specified requirements, submit all necessary documents, and comply with the outlined submission guidelines to be considered for the contract.",
    "specific_service": "gpr survey",
    "key_points": ". CESC Limited is seeking bids for conducting a GPR (Ground Penetrating Radar) survey along the Kona Expressway stretch between 2nd Hooghly Bridge and Santragachi Flyover., . The scope of work includes identifying underground utility assets, preparation of topographical survey, and submission of reports as per Section I- Annexure-II., . Bidders are required to submit both an Unpriced Techno-Commercial Bid and a Price Bid (Annexure-III) within the specified deadline., . Deviations from the tender terms are generally not allowed, and bids with deviations may be rejected. Any deviations must be clearly outlined by the Bidders in a deviation sheet (Annexure-V) as part of the Technical Bid., . Bids will not be accepted after the deadline date and time, and no alterations or additions to the bid form or special stipulations will be permitted., . Corrections to the bid form must be made by the Bidder with dated signature, and all pages of the bid papers and accompanying documents must be initialed at the lower right-hand corner with ink and signed where required., . The project is specified to cover a 2.5 km stretch with a width of 35 meters along the Kona Expressway, and the submission of reports is a critical requirement within the scope of work.",
    "file_path": "Data\\Service_CESC Kolkata for GPR Survey.docx",
    "filename": "Service_CESC Kolkata for GPR Survey.docx",
    "complexity": "Complex",
    "rfp_type": "Survey_Contract",
    "word_count": 7402,
    "service_confidence": 0.5,
    "rfp_type_confidence": 0.36,
    "key_terms": "distribution, cable, installation, commissioning, safety, quality, specification, requirement, technical, commercial, financial, timeline, delivery, gpr, survey, infrastructure, equipment, Is, Commercial\nCapability, User Group",
    "client_confidence": 1.0,
    "equipment_confidence": 0.25
  },
  "72e01bbe-8ca3-4521-951a-c3b196f8b718": {
    "specific_service": "gis",
    "client_name": "CPDL",
    "document_version": "v1.0",
    "rfp_type": "Service_Agreement",
    "word_count": 29652,
    "document_type": "Service",
    "service_confidence": 0.3888888888888889,
    "complexity": "Complex",
    "key_points": ". The RFP is for the implementation of GIS infrastructure at CPDL, Chandigarh, with a due date for bid submission of 15.09.2025., . The purpose of the RFP is to competitively select a suitable solution for the proposed digitization of the complete electrical network and consumers connected with the same for complete GIS implementation at CPDL., . The RFP defines the comprehensive physical and technical requirements of CPDL to ensure that the bidder proposes a future-proof solution meeting CPDL's requirements and offers the most cost-effective solution., . Bidders are advised to carefully study the RFP document, and submission of the RFP implies a full understanding of its implications., . The RFP outlines descriptions of the software, hardware, engineering, and services associated with the SCADA and DMS to achieve the overall goal of GIS implementation., . Bidders must abide by all relevant environmental and safety regulations in India and outline their waste, noise, and oil leak management measures., . The RFP serves as a guideline to solicit proposals from bidders for the GIS implementation at CPDL.",
    "client_confidence": 0.8,
    "service_category": "Electrical_Infrastructure",
    "document_purpose": "template",
    "equipment_confidence": 0.75,
    "key_terms": "transformer, substation, distribution, transmission, cable, installation, commissioning, testing, maintenance, safety, quality, specification, requirement, technical, commercial, financial, timeline, delivery, warranty, survey",
    "filename": "Service_CPDL for GIS.docx",
    "equipment_type": "GIS",
    "overall_confidence": 0.5547222222222222,
    "is_duplicate": false,
    "processing_date": "2026-01-27 16:10:13.495295",
    "original_filename": "Service_CPDL for GIS.docx",
    "file_path": "Data\\Service_CPDL for GIS.docx",
    "content_summary": "This RFP document, issued by Chandigarh Power Distribution Limited (CPDL), focuses on the implementation of a GIS infrastructure at CPDL in Chandigarh. The main purpose of this RFP is to competitively select a suitable solution for the digitization of the complete electrical network and connected consumers to achieve a comprehensive GIS implementation at CPDL. Bidders are expected to propose a future-proof solution that meets CPDL's requirements, estimates costs, and offers the most cost-effective approach. The document emphasizes the importance of carefully studying and understanding all requirements outlined to ensure compliance and successful implementation.\n\nKey requirements and specifications outlined in the RFP include descriptions of software, hardware, engineering, and services related to SCADA and DMS systems. Bidders are required to adhere to all relevant environmental and safety regulations in India and must provide details of their waste, noise, and oil leak management measures. The RFP also provides information on how interested parties can obtain the schedule of specifications, terms & conditions, and submit the tender fee via online transfer mode (NEFT/RTGS) to access the detailed requirements for bidding.\n\nThe RFP includes a timeline for the submission of bids, with the due date set for 15.09.2025, up to 17:00 Hrs. Bidders must ensure timely submission within the specified date and time as per the event calendar provided in the document. The commercial terms, including the non-refundable tender fee amount and the mode of payment, are clearly specified to guide interested parties in the bidding process. Overall, this RFP serves as a comprehensive guide for potential bidders to understand the scope, requirements, technical details, safety regulations, and submission guidelines for the GIS infrastructure implementation project at CPDL in Chandigarh.",
    "rfp_type_confidence": 0.27999999999999997
  },
  "cd28f28e-1b54-423f-b5dd-2b9763424edb": {
    "document_purpose": "template",
    "original_filename": "Service_MPSL for Billing Recovery.docx",
    "is_duplicate": false,
    "file_path": "Data\\Service_MPSL for Billing Recovery.docx",
    "client_name": "MPSL",
    "complexity": "Complex",
    "overall_confidence": 0.5166666666666666,
    "service_confidence": 0.4166666666666667,
    "content_summary": "The RFP document issued by Malegaon Power Supply Limited (MPSL) focuses on the service of revenue recovery from defaulter consumers and disconnection of supply in the distribution franchise area of MPSL. The purpose of the RFP is to invite bids for providing services for the recovery of outstanding bills within a rate contract valid for 1 year. The document outlines the calendar of events, emphasizes that deviations from tender terms are generally not acceptable, and specifies mandatory pre-qualification criteria for interested bidders.\n\nKey requirements for bidders include submitting mandatory documents such as a schedule of deviations, commercial specifications, authorization letter, and various registrations. The submission process involves two parts: the technical bid and the commercial bid. The technical bid requires details about the bidder's company profile, experience in similar projects, financial statements, and evidence of meeting qualification criteria. Bidders are also required to provide a no deviation certificate and acceptance of commercial terms and conditions as specified in the document.\n\nThe document does not provide detailed technical specifications or equipment requirements but focuses more on the administrative and pre-qualification aspects of the bidding process. The timeline for submission and review of bids is not explicitly mentioned in the provided excerpt. Overall, the RFP outlines a structured process for interested bidders to participate in providing billing recovery services to MPSL, emphasizing compliance with the specified terms and conditions for successful bid submission.",
    "equipment_type": "HT_LT_Cable",
    "word_count": 9160,
    "rfp_type_confidence": 0.6,
    "equipment_confidence": 0.25,
    "filename": "Service_MPSL for Billing Recovery.docx",
    "document_type": "Service",
    "key_points": ". The RFP is for revenue recovery from defaulter consumers and disconnection of supply at Malegaon Power Supply Limited (MPSL), a distribution franchisee in Nasik District of Maharashtra., . The tender is for a Rate Contract valid for 1 year., . Deviations from tender terms are generally not allowed, and bids with deviations may be rejected., . Pre-qualification criteria and mandatory documents required include signed 'Schedule of Deviations' and 'Schedule of Commercial Specifications', authorization letter, and copies of PAN, GST, PF, and ESI registrations., . Bidders must submit their offers in line with the tender document., . Deviations, if any, must be clearly outlined in Annexure-II., . The timeline for the tender process and submission of bids is not explicitly mentioned in the extracted text.",
    "key_terms": "distribution, cable, installation, commissioning, maintenance, safety, quality, specification, requirement, technical, commercial, financial, timeline, survey, infrastructure, equipment, Is, Commercial\nCapability, User Group, Detailed Organogram",
    "rfp_type": "Metering_Project",
    "service_category": "Operations_Maintenance",
    "client_confidence": 0.8,
    "specific_service": "billing recovery",
    "document_version": "v1.0",
    "processing_date": "2026-01-27 16:10:21.720309"
  },
  "071d21d6-fafd-424b-b701-82419e12bbb4": {
    "service_confidence": 0.4444444444444444,
    "filename": "Service_MPSL for O&M and Capex Jobs.docx",
    "key_points": ". Tender is for O&M and Capex jobs at Malegaon Power Supply Limited (MPSL), a Distribution Franchisee in Nasik District of Maharashtra., . Rate Contract to be valid for 3 years., . Deviations from tender terms are generally not allowed, and bids with deviations may be rejected., . Pre-qualification criteria must be met by bidders., . Mandatory documents required with the bid include Schedule of Deviations, Schedule of Commercial Specifications, authorization letter, and copies of PAN, GST, PF, and ESI registrations., . Bidders must submit their offers in line with the tender document., . MPSL will respond to clarification raised by bidders via email.",
    "equipment_confidence": 0.5,
    "file_path": "Data\\Service_MPSL for O&M and Capex Jobs.docx",
    "document_version": "v1.0",
    "is_duplicate": false,
    "document_type": "Service",
    "specific_service": "o&m and capex jobs",
    "equipment_type": "DTR",
    "client_name": "MPSL",
    "document_purpose": "template",
    "key_terms": "transformer, distribution, cable, installation, commissioning, maintenance, safety, quality, specification, requirement, technical, commercial, financial, timeline, survey, equipment, Is, Commercial\nCapability, User Group, Force Majeure",
    "word_count": 8338,
    "rfp_type": "Service_Agreement",
    "service_category": "Operations_Maintenance",
    "rfp_type_confidence": 0.33333333333333337,
    "client_confidence": 0.8,
    "complexity": "Complex",
    "overall_confidence": 0.5194444444444444,
    "original_filename": "Service_MPSL for O&M and Capex Jobs.docx",
    "content_summary": "The RFP document is issued by Malegaon Power Supply Limited (MPSL) for O&M and Capex jobs at their distribution franchise area in Nasik District, Maharashtra. The purpose of the RFP is to invite bids for providing services related to operations and maintenance as well as capital expenditure projects. The contract is intended to be valid for 3 years, and interested bidders are required to adhere to the specified scope of work and terms & conditions outlined in the document.\n\nKey requirements for bidders include submitting mandatory documents such as a Schedule of Deviations, Schedule of Commercial Specifications, authorization letter, and various registrations like PAN, GST, PF, and ESI. Bidders are advised against deviating from the tender terms, as deviations may lead to rejection of bids. The pre-qualification criteria and submission process are clearly defined, with bids to be submitted in two parts - a Technical Bid and a Commercial Bid.\n\nThe Technical Bid should include details about the bidder's company profile, manpower details, past experience in similar projects, financial statements, and compliance with qualifying criteria. Bidders are also required to provide a No Deviation Certificate and accept the commercial terms and conditions specified in the document. The submission process involves emailing the Technical Bid to the designated email addresses provided in the RFP document. Overall, the RFP outlines a structured process for interested bidders to submit their proposals for consideration by MPSL for the O&M and Capex jobs contract.",
    "processing_date": "2026-01-27 16:10:29.295047"
  },
  "c8631ee0-b859-4901-9bc7-886399392e86": {
    "complexity": "Complex",
    "key_points": ". CESC Limited is seeking a Rate Contract for 2 years (from Apr’25 to Mar’27) for the supply of 1-phase & 3-Phase Whole Current Meters for Kolkata., . The quantity of meters required is approximate and may vary up to +/- 10%., . Vendors must deliver the meters within 6-8 weeks from the placement of Firm Orders, as per periodic delivery schedules issued against formal Purchase Orders., . The price basis for the meters should be FOR-Site, inclusive of freight & insurance but excluding local warehousing charges. GST will be paid extra at actuals., . The supplied meters must come with a warranty against design, manufacturing, and workmanship defects for 5 years from the delivery date, with the responsibility for necessary replacements on a \"Free of Cost\" basis within the warranty period., . Replacement of faulty meters and deviations from approved specifications must be done within 4 weeks from the intimation of failure., . In case of premature failure of the meters, the approximate cost of replacement should be specified.",
    "original_filename": "Supply_CESC Kolkata for Energy Meters.docx",
    "key_terms": "distribution, transmission, cable, testing, inspection, quality, specification, requirement, technical, commercial, financial, delivery, warranty, equipment, Trade, Vendors, Guarantee, Password, Years, Bids",
    "document_type": "Supply",
    "specific_service": "energy meters",
    "is_duplicate": false,
    "word_count": 2046,
    "document_purpose": "template",
    "rfp_type": "Metering_Project",
    "file_path": "Data\\Supply_CESC Kolkata for Energy Meters.docx",
    "document_version": "v1.0",
    "rfp_type_confidence": 0.6,
    "equipment_confidence": 1.0,
    "client_name": "CESC_Kolkata",
    "content_summary": "The RFP issued by CESC_Kolkata is for the supply of 1-phase & 3-Phase Whole Current Meters for a 2-year Rate Contract from April 2025 to March 2027. CESC Limited, a private power utility under the RP-Sanjiv Goenka Group, is seeking interested and eligible vendors through a Two-Part Bidding Process. The scope of supply includes an approximate quantity of different types of whole current meters, with a flexibility of +/- 10% in quantity variation. Vendors are required to deliver the meters in multiple parts within 6-8 weeks from the placement of Firm Orders, following periodic delivery schedules issued against formal Purchase Orders.\n\nThe pricing basis for the meters is on a FOR-Site basis, inclusive of freight & insurance but excluding local warehousing charges. GST will be paid extra at actuals. The meters supplied should come with a warranty of 5 years against design, manufacturing, and workmanship defects, with the responsibility for necessary replacements falling on the vendor within the warranty period. In case of premature failure, a cost of Rs.1250/- associated with replacement will be levied on the vendor. The standard payment term is 90 days from the submission of the bill after the supply & acceptance of meters at CESC designated local warehouse/store.\n\nPre-qualification criteria for bidders include meeting Qualification Requirements such as technical capability to handle the jobs detailed in the tender, owning a manufacturing facility in India for the meters, and having in-house testing facilities for acceptance tests as per CESC's technical specifications. New vendors not registered with CESC may undergo factory inspection and evaluation to assess their manufacturing capability and quality procedures. Overall, the RFP outlines specific requirements, delivery terms, pricing, warranty, payment terms, and pre-qualification criteria for vendors interested in participating in the supply of energy meters for CESC_Kolkata's Metering_Project.",
    "filename": "Supply_CESC Kolkata for Energy Meters.docx",
    "client_confidence": 1.0,
    "service_confidence": 0.3333333333333333,
    "overall_confidence": 0.7333333333333334,
    "equipment_type": "Energy_Meters",
    "service_category": "Electrical_Infrastructure",
    "processing_date": "2026-01-27 16:10:36.609974"
  },
  "b67950d1-ab6f-460a-9460-435e1a78b5fc": {
    "key_terms": "cable, installation, commissioning, testing, inspection, safety, quality, specification, requirement, technical, commercial, financial, timeline, delivery, warranty, infrastructure, equipment, Financial Proposals, Financial Qualification Criteria, Patent",
    "rfp_type": "Supply_Contract",
    "client_name": "CESC_Kolkata",
    "rfp_type_confidence": 0.33333333333333337,
    "content_summary": "The RFP document issued by CESC Kolkata is for a 2-year Rate Contract for the supply of HT and LT cables. The main purpose of the RFP is to invite bids from prospective suppliers to provide these cables, with a focus on encouraging manufacturing within India to support the 'Make in India' initiative. Bidders are required to comply with environmental and safety regulations, including waste, noise, and oil leak management measures. The document outlines the technical specifications and terms for the supply of HT and LT cables, emphasizing the need for complete technical details and adherence to the event calendar for bid submission.\n\nKey requirements and specifications include the qualification criteria for bidders, which involve technical and financial aspects. Bidders must meet specific financial turnover requirements and provide audited financial statements or CA certificates to demonstrate their eligibility. Additionally, bidders must confirm that they have not been blacklisted or debarred by any government entity, have no pending insolvency or bankruptcy proceedings, and have no ongoing litigation with CESC or its associated companies. Compliance with statutory requirements such as PAN No. and GST Registration Number is also mandatory for bidders.\n\nThe RFP document does not specify detailed technical equipment involved but focuses on the broader requirements related to the supply of HT and LT cables. The timeline and deliverables are outlined in the event calendar, with a due date for bid submission mentioned. Special conditions include the right of CESC Limited to accept or reject tenders based on specific criteria such as pricing details, technical completeness, and timely submission. The commercial terms are not explicitly mentioned in the provided summary but may be detailed in the full RFP document available on the CESC website for interested bidders to review.",
    "overall_confidence": 0.6944444444444444,
    "equipment_type": "HT_LT_Cable",
    "service_confidence": 0.4444444444444444,
    "document_version": "v1.0",
    "filename": "Supply_CESC Kolkata for HT & LT Cable.docx",
    "document_purpose": "template",
    "complexity": "Complex",
    "key_points": ". CESC is inviting bids for a 02 Years Rate Contract for the supply of HT and LT Cables in Kolkata, emphasizing alignment with the 'Make in India' initiative., . Prospective bidders are encouraged to manufacture the cables within India to support local industry growth and ensure efficient after-sales support., . Bidders must comply with all relevant environmental and safety regulations in India, including waste, noise, and oil leak management measures., . The bid submission deadline is specified, and CESC reserves the right to accept or reject tenders based on criteria such as pricing details, technical completeness, and submission timing., . Detailed technical specifications and terms & conditions can be obtained from the CESC website., . The OEM must have an Average Annual Sales Turnover of Rs 500 Crores, based on the best three financial years out of the last four, to meet financial qualification criteria., . Bids must adhere to the event calendar timeline for submission.",
    "word_count": 13491,
    "file_path": "Data\\Supply_CESC Kolkata for HT & LT Cable.docx",
    "document_type": "Supply",
    "original_filename": "Supply_CESC Kolkata for HT & LT Cable.docx",
    "specific_service": "ht & lt cable",
    "is_duplicate": false,
    "service_category": "Electrical_Infrastructure",
    "processing_date": "2026-01-27 16:10:46.805832",
    "client_confidence": 1.0,
    "equipment_confidence": 1.0
  },
  "f0ec0fd3-a5aa-492e-ae63-96e58905c3a5": {
    "service_confidence": 0.3888888888888889,
    "complexity": "Complex",
    "specific_service": "dtr",
    "equipment_type": "DTR",
    "word_count": 6160,
    "client_name": "CESC_Kolkata",
    "document_type": "Supply",
    "rfp_type_confidence": 0.3,
    "is_duplicate": false,
    "client_confidence": 0.8,
    "key_terms": "transformer, distribution, transmission, cable, installation, testing, inspection, quality, specification, requirement, technical, commercial, financial, timeline, delivery, warranty, equipment, Financial Qualification Criteria, Total Amount, Bidding",
    "equipment_confidence": 1.0,
    "file_path": "Data\\Supply_CESC Rajasthan for DTR.docx",
    "processing_date": "2026-01-27 16:10:55.766442",
    "key_points": ". Open tender notification for Rate Contract for Supply of various rating of 1-Phase and 3-Phase AL & CU Wound Distribution Transformer at CESC, Rajasthan., . Due Date for Bid Submission: 09/10/25 [17:00 Hrs.], . Bids invited in Two Bid system for establishing a Rate Contract with two years validity for supply of various rating of 1phase and 3 phase AL & CU Wound Distribution Transformer., . Scope of work includes awarding Rate Contract for supply of transformers with one year validity., . Tender documents can be downloaded from CESC Rajasthan tender website., . Non-Refundable Tender Participation Fee required to be submitted before the last date of tender fee payment., . Operating as wholly owned subsidiaries of CESC Limited, as Kota Electricity Distribution Limited (KEDL), Bharatpur Electricity Services Limited (BESL) and Bikaner Electricity Supply Limited (BkESL) for a span of 20 years.",
    "rfp_type": "Supply_Contract",
    "content_summary": "The RFP document is a Supply Contract for the supply of various ratings of 1-Phase and 3-Phase AL & CU Wound Distribution Transformers at CESC, Rajasthan. The main purpose of the RFP is to establish a Rate Contract with a two-year validity period. Bids are invited from interested Bidders to supply the transformers as per the specified requirements outlined in the tender document. The scope of work includes the supply of transformers with one year validity, and interested bidders are required to meet the technical and financial qualification criteria specified in the document.\n\nKey requirements and specifications outlined in the RFP include the availability of tender documents for download from the CESC Rajasthan tender website, submission of a non-refundable Tender Participation Fee, and the submission of bids in a Two Bid system. The technical qualification criteria are divided into different parts for CU and AL materials, and financial qualification criteria are also specified for evaluation purposes. Bidders are required to adhere to the tender terms and conditions for their bids to be considered.\n\nThe timeline for bid submission is specified as the due date for bid submission is 09/10/25 at 17:00 Hrs. The document also provides information on the pre-qualification criteria, evaluation criteria, and the process for obtaining the online bidding link. It is important to note that in case the last date for bid submission or bid opening is a closed holiday for CESC's office, the submission and opening dates will be adjusted to the next working day. The RFP emphasizes the importance of meeting the technical and financial qualification criteria for successful bid evaluation.",
    "document_purpose": "template",
    "overall_confidence": 0.6222222222222222,
    "service_category": "Electrical_Infrastructure",
    "original_filename": "Supply_CESC Rajasthan for DTR.docx",
    "filename": "Supply_CESC Rajasthan for DTR.docx",
    "document_version": "v1.0"
  },
  "0f914bdb-143a-41a5-ac23-8ddad423a56c": {
    "key_points": ". The RFP is for the purchase order of 66-33/11 kV 20 MVA PTR at Chandigarh, CPDL., . Bidders are encouraged to manufacture the PTR within India to support the 'Make in India' initiative., . Bidders must comply with all relevant environmental and safety regulations in India, including waste, noise, and oil leak management measures., . Detailed technical specifications are provided in the bid document for the 66-33/11 kV 20 MVA PTR., . The tender fee for obtaining the schedule of specifications is Rs.1180/- via online transfer mode (NEFT/RTGS) only., . Bidders downloading tender papers must enclose proof of online transfer during submission of the bid document., . The due date for bid submission is specified, and bids must be submitted by 17:00 Hrs on the mentioned date.",
    "equipment_type": "PTR",
    "client_confidence": 0.8,
    "service_confidence": 0.3888888888888889,
    "is_duplicate": false,
    "key_terms": "transformer, distribution, transmission, cable, installation, commissioning, testing, maintenance, inspection, safety, quality, specification, requirement, technical, commercial, financial, timeline, delivery, warranty, infrastructure",
    "document_purpose": "template",
    "processing_date": "2026-01-27 16:11:03.771094",
    "rfp_type": "Supply_Contract",
    "rfp_type_confidence": 0.28888888888888886,
    "word_count": 18122,
    "service_category": "Electrical_Infrastructure",
    "overall_confidence": 0.6194444444444445,
    "complexity": "Complex",
    "content_summary": "This RFP document issued by Chandigarh Power Distribution Limited (CPDL) is for the purchase order of a 66-33/11 kV 20 MVA PTR (Power Transformer) at Chandigarh, India. The main purpose of this RFP is to invite bids from prospective suppliers to provide the specified PTR in accordance with the detailed technical specifications outlined in the bid document. CPDL encourages bidders to manufacture the PTR within India to support the 'Make in India' initiative, promote local industry growth, reduce delivery times, and ensure efficient after-sales support. Bidders are also required to comply with all relevant environmental and safety regulations in India, including waste, noise, and oil leak management measures.\n\nThe RFP includes a schedule of specifications and terms & conditions that can be obtained from the CPDL tender website upon payment of a non-refundable tender fee of Rs.1180 via online transfer mode (NEFT/RTGS). Bidders are expected to submit their bids within the specified date and time mentioned in the event calendar. CPDL reserves the right to accept or reject any tender without providing a reason, based on criteria such as non-submission of tender fee, absence of earnest money deposit, incomplete technical details, late submission, or missing price breakdown for taxes and duties.\n\nThe document also outlines qualification criteria for bidders, including technical and financial aspects. The bid opening date serves as the reference point for the year calculation regarding qualification criteria. Overall, this RFP emphasizes the importance of meeting technical specifications, complying with regulations, and supporting local manufacturing while providing clear guidelines for bid submission and evaluation. Interested suppliers are encouraged to review the complete RFP document on the CPDL website for detailed information and instructions on submitting their bids.",
    "client_name": "CPDL",
    "file_path": "Data\\Supply_CPDL for 20 MVA PTR.docx",
    "document_version": "v1.0",
    "original_filename": "Supply_CPDL for 20 MVA PTR.docx",
    "document_type": "Supply",
    "filename": "Supply_CPDL for 20 MVA PTR.docx",
    "specific_service": "20 mva ptr",
    "equipment_confidence": 1.0
  },
  "d0496640-1f80-4459-9431-0cd5f5125411": {
    "document_purpose": "template",
    "client_name": "CPDL",
    "content_summary": "The RFP document issued by Chandigarh Power Distribution Limited (CPDL) is for a 02 Years Rate Contract for the supply of HT and LT Cables in Chandigarh, India. The main purpose of the RFP is to invite bids from prospective suppliers who can manufacture the cables within India, aligning with the 'Make in India' initiative. Bidders are required to comply with environmental and safety regulations, including waste, noise, and oil leak management measures. The document emphasizes the importance of fostering local industry growth and ensuring efficient after-sales support.\n\nKey requirements and specifications outlined in the RFP include the approved makes for the cables, such as KEI, UCL, Torrent, Havells, Gemscab, and Laser Power. Bidders must meet specific technical and financial qualification criteria, including having an Average Annual Sales Turnover of Rs 500 Crores based on the best three financial years out of the last four. The RFP also specifies the process for submitting bids, including the tender fee amount, payment details, and the deadline for bid submission.\n\nThe document provides a detailed calendar of events, outlining the timeline for bid submission and the consequences of non-compliance with the submission requirements. It also highlights the conditions under which CPDL reserves the right to accept or reject tenders, such as non-submission of tender fee, incomplete technical details, or late submission. The RFP aims to ensure transparency and fairness in the selection process while setting clear expectations for potential suppliers regarding technical specifications, financial qualifications, and compliance with regulations.",
    "word_count": 18221,
    "specific_service": "lt and ht cable",
    "original_filename": "Supply_CPDL for LT and HT Cable.docx",
    "equipment_confidence": 1.0,
    "service_confidence": 0.4166666666666667,
    "client_confidence": 0.8,
    "overall_confidence": 0.6327380952380952,
    "document_version": "v1.0",
    "key_terms": "distribution, cable, installation, commissioning, testing, maintenance, inspection, safety, quality, specification, requirement, technical, commercial, financial, timeline, delivery, warranty, infrastructure, equipment, Financial Proposals",
    "document_type": "Supply",
    "filename": "Supply_CPDL for LT and HT Cable.docx",
    "file_path": "Data\\Supply_CPDL for LT and HT Cable.docx",
    "is_duplicate": false,
    "rfp_type_confidence": 0.3142857142857143,
    "rfp_type": "Supply_Contract",
    "complexity": "Complex",
    "key_points": ". NIT No. CPDL/FY25-26/HT & LT Cable/008 for 02 Years Rate Contract for the Supply of HT and LT Cables in Chandigarh, CPDL., . Due Date for Bid Submission: 29.07.2025 (Up to 17:00 Hrs)., . Bidders are encouraged to manufacture the HT and LT Cables within India to align with the 'Make in India' initiative, ensuring local industry growth, reduced delivery times, and efficient after-sales support., . Bidders must comply with all relevant environmental and safety regulations in India, including waste, noise, and oil leak management measures., . CPDL invites bids for HT and LT Cables as per the Technical Specification provided in the tender document., . The tender fee for obtaining the schedule of specifications is Rs.1180/- (Inclusive of GST) via online transfer mode (NEFT/RTGS) to CPDL's State Bank of India account., . Bidders who download tender papers must enclose a scan copy of the money receipt/UTR No (proof of online transfer) when submitting the tender.",
    "processing_date": "2026-01-27 16:11:11.603507",
    "service_category": "Electrical_Infrastructure",
    "equipment_type": "HT_LT_Cable"
  }
}